##### SQL is part of term 1: we will be focussing on the key notes

```
SELECT col1 + col2 as sum
FROM the_table
WHERE col3 = 'US';
```

##### Quiz Arithmatic Operation

```
SELECT id, account_id, standard_amt_usd/standard_qty as unit_price
FROM table
LIMIT 10;
```

##### LIKE

```
SELECT * 
FROM table
WHERE col1 LIKE '%google%'

```
To Search col1 (text column) with a word google in it

##### IN

```
SELECT *
FROM table
WHERE col1 in (1001,1021)
```

##### NOT

```
SELECT *
FROM table
WHERE col1 NOT LIKE '%google%'
```

```
SELECT * 
FROM table
WHERE col1 NOT IN (100,200)
ORDER BY col1 DESC
```

##### AND & BETWEEN

```
SELECT * 
FROM table
WHERE col1 NOT IN (100,150) AND col2 BETWEEN 200 AND 300
```

##### OR and IN being same

```
SELECT *
FROM table
WHERE col1 in (100,200)
```

```
SELECT * 
FROM table
WHERE col1 = 100 OR col1 = 200
```

### Joins

##### Inner Join

```
SELECT *
FROM table1
JOIN table2
ON table1.col1 = table2.col2
```

##### Join multiple tables

```
SELECT table1.col2, table2.col4, table3.col6
FROM table1
JOIN table2
on table1.col1 = tables2.col2
JOIN table3
on table2.col2 = table3.col3
```

```
SELECT t1.col2, t2.col4, t3.col6
FROM table1 t1
JOIN table2 t2
on t1.col1 = t2.col2
JOIN table3 t3
on t2.col2 = t3.col3
```

##### Left outer join an left join are same

```
SELCT t1.col1, t2.col2
FROM table1 t1
LEFT JOIN  table2 t2
ON t1.col1 = t2.col1
```

##### joining and filtering together: subsets it first (even before to where clause)

```
SELECT t1.c1, t2.c2
FROM table1 t1
JOIN table2 t2
on t1.c1 = t2.c1 and t1.c1 == 100
```

##### Union : generates unique rows

```
SELECT t1.c1
FROM table1 t1
UNION
SELECT t2.c1
FROM table2 t2
```

##### UNION ALL: generates duplicate rows as well

##### CROSS JOIN: when 2 atomic table grow on their own , there may be scenario we check the permutation of it. for e.g. rules and regularization to all the department.

```
SELECT *
FROM table1 t1
CROSS JOIN table2 t2
```

##### SELF JOIN

```
SELECT * 
FROM table1 t1, table1 t2
WHERE t1.city = t2.city and t1.id <> t2.id
```
##### To list all the id with same city. As a replacement to group by

### Aggregation

##### Nulls

```
SELECT *
FROM table1 t1
WHERE t1 IS NOT NULL
```

##### Count

```
SELECT COUNT(*) total_new_joiner
FROM table as t1
WHERE t1.id > 2000
```

##### COUNT(*) is not equal to COUNT(col1); if the column has NULL values

##### SUM

```
SELECT SUM(t1.marks) total_marks
FROM table as t1
WHERE t1.dep_id == 100
```
##### SUM will treat NULL as 0

##### Min & Max

```
SELECT MIN(c.population) low_population,
        MAX(c. population) high_population,
        c.continent_id

FROM continent as c        
```

##### AVG: ignores null values all together; nor in numerator or denominator

##### Median

```
SELECT count(*)
FROM table1

```
##### Note the value and divide by 2. Again note the devisor
```
SELECT *
FROM (SELECT col1 FROM table1 ORDER BY col1 LIMIT divisor) as table_new
order by col1 desc
LIMIT 2
```

##### GROUP BY

It lies between WHERE and ORDER BY and must be included if the SELECT statement includes columns which are NOT aggregated.

```
SELECT t1.c1, t1.c2, SUM(t1.c3) Total
FROM table1 t1
GROUP BY t1.c1, t1.c2
```

##### DISTINCT

```
SELECT DISTINCT c1 , c2
FROM table
```

DISTINCT removes the dependency of the aggregator function in select clause ; if only group by was the intent.

##### HAVING

```
SELECT COUNT(*) num_gt_5_cnt
FROM ( SELECT COUNT(*) gt_5
        FROM table_old to
        group by to.id
        having count(*) > 5
) as table1 t1
GROUP BY t1.gt_5

```
##### To print number of id > 5 sets

##### DATE_TRUNC

```
SELECT DATE_TRUNC('year', col_datetime), SUM(col2)
FROM table
GROUP BY 1
ORDER BY 2 DESC
```

DATE_PART : takes the portion of the date leaving rest .

##### CASE (equivalent to if condition in pgming)

```
SELECT CASE WHEN t1.c1 > 90 THEN 'A+'
            WHEN t1.c1 > 50 and t1.c1 < 90 THEN 'A'
            END as grades
FROM table1 t1
ORDER BY 1 
```

##### Subquery (nothing but one query output forms the table of another query)

###### To list the activities per day per channel
```
SELECT DATE_TRUNC('day',datetime_col) 'day', channel, count(*) num_of_events
FROM event_table
GROUP BY 2,1
```

##### To get the average activities per channel
```
SELECT channel, AVG(num_of_events)
FROM (SELECT DATE_TRUNC('day',datetime_col) 'day', channel, count(*) num_of_events
        FROM event_table
        GROUP BY 2,1) sub
GROUP By 1
ORDER BY 2
```

##### Subquery in WHERE Clause
```
SELECT *
FROM table1
WHERE c1 = (SELECT MAX(c2)
            FROM table1
            )
```

##### Joining subqueries
```
SELECT *
FROM (
      ( SELECT c2, MAX(c1)
          FROM table1 as t1
      ) tab1
JOIN (
      SELECT c2, MIN(C1)
      FROM table1 as t1
      ) tab2
ON tab1.c2 != tab2.c2
) new_tab
```
##### I am assuming that above will have both max in min output of a table which can be done through UNION easily.

##### Saving Subquery
```
WITH sub1 as (SELECT age, count(*) num_of_ppl
FROM students
GROUP BY age
ORDER BY 2 DESC)

SELECT age , num_of_ppl
FROM sub1
LIMIT 5
```
##### Top 5 age group for pupils

```
SELECT age , num_of_ppl
FROM sub1
ORDER BY num_of_ppl DESC
LIMIT 5
```
##### Re using the sub query for the bottom 5 age group for pupils.

##### LEFT& RIGHT function

```
SELECT LEFT(pan_number, 3), COUNT(*) series_count
FROM PAN
GROUP BY 1
ORDER BY 2 DESC
```

```
SELECT RIGHT(url,3), COUNT(*) domain_count
FROM WEBSITE_LIST
GROUP BY 1
ORDER BY 2 DESC
```
##### Assuming that website have only 2 char extention

##### STRPOS, POSITION, LENGTH

```
SELECT RIGHT(email_id, STRPOS(email_id, '@')) email_provider, COUNT(*) mail_vendor_count
FROM PERSONAL_INFO
```

```
SELECT LEFT(email_id, STRPOS(email_id, '@')-1) id, LENGTH(LEFT(email_id, STRPOS(email_id, '@')-1)) id_length
FROM EMAIL_REPO
```

##### CONCAT or ||

```
SELECT first_name || last_name full_name
FROM employee 

SELECT CONCAT(first,last) full_name
FROM employee
```

##### CAST or ::

```
SELECT CAST(year_col||'-'||month_col||'-'||date_column as date) formated_date
FROM some_table



SELECT (year_col||'-'||month_col||'-'||date_column):: date formated_date
FROM some_table
```

##### COALESCE

```
SELECT COALESCE(col1, 0)
FROM table1
WHERE col1 is null
```
##### We would see col1 as 0

#### Window functiton: PARTITION BY acts as GROUP BY clause at SELECT statement

##### with +over+runs+wickets+ as table

```
SELECT overs, SUM(runs) OVER (PARTITION BY wickets ORDER BY overs) total_runs_between_wickets
FROM SCORECARD
```

##### ROW_NUMBER() and RANK :

```
SELECT ROW_NUMBER() OVER (PARTITION BY dept_id ORDER BY dept_id) row_number
FROM employee


SELECT RANK() OVER (PARTITION BY dept_id ORDER BY dept_id) rank_number
FROM employee
```
##### RANK gives the same value to 2 rows if they are same where are row_number shows unique numbers for rows.

```
SELECT overs, SUM(runs) OVER (PARTITION BY wickets ORDER BY overs) total_runs_between_wickets,
		MAX(runs) OVER (PARTITION BY wickets ORDER BY overs) max_runs_between_wickets,
		Min(runs) OVER (PARTITION BY wickets ORDER BY overs) max_runs_between_wickets,
		
FROM SCORECARD
```
##### Between 2 wickets fall per over min and max score along with total score.

##### WINDOW (alias for window function):

```
SELECT overs, SUM(runs) OVER main_window total_runs_between_wickets,
		MAX(runs) OVER main_window max_runs_between_wickets,
		Min(runs) OVER main_window max_runs_between_wickets,
		
FROM SCORECARD
WINDOW main_window as (PARTITION BY wickets ORDER BY overs)
```


##### LEAD & LAG

```
SELECT overs, SUM(runs) OVER main_window total_runs_between_wickets,
		LAG(runs) OVER main_window max_runs_between_wickets old_over_score,
		Lead(runs) OVER main_window max_runs_between_wickets next_over_score,
		Lead(runs) OVER main_window max_runs_between_wickets - SUM(runs)
	
FROM SCORECARD
WINDOW main_window as (PARTITION BY wickets ORDER BY overs)
```
##### previous and next over score each over

##### NTILE: ORDER BY determines on which NTIL has to apply

```
SELECT NTILE(4) OVER (PARTITION BY overs ORDER BY runs) 
FROM SCORECARD
```
##### Overall runs are split into 4 parts and score after each over is checked against which quantile the runs belongs to. May be to check how fast score grew in the interval of quantiles.

##### Note: Quartile indicates continuous data is divided in to 4 parts. quantiles are flexible to divide the continuous data into multiple parts.

### Advanced concepts

##### difference between outerjoin and union; union require to have 2 table columns to be same and it just concatenates. outerjoin, joins columns from 2 table

##### What if the column names are same ? will except joining key every other columns are retained with suffix or prefix ?
##### Ideally 2 tables are related by only PK and FK but when 2 tables are same what is output of OUTER JOIN ?
##### Will union have duplicate records ? or will PK constraints avoid duplicate rows ? so if PK is not defined then will there be duplicate ?

##### Getting unmatched rows in FULL OUTER JOIN

```
SELECT *
FROM table1
FULL JOIN table2
ON table1.col1 = table2.col2
WHERE table1.col1 IS NULL OR table2.col2 IS NULL

```

So What would happen is FULL JOIN condition would fail if there are no matching rows and they are are part of the initial shorlist of rows but WHERE clause will make sure that intersecting portion is not include as the key is expected to be NULL

##### Inequality joins : joins need not be all the time PK = FK, it can be as simple as some column other than PK, FK or including PK FK like PK and FK < 5

```
SELECT *
FROM table1
JOIN table2
ON table1.pk < 5 and table2.pk < 5
```

##### below is one more example of inquality join:
```
SELECT *
FROM table1
JOIN table2
ON table1.col1 = table2.col2
WHERE table1.col5 < table2.col5
```

##### SELF JOIN: to know which are rows in the same table has relation with other rows

```
SELECT o1.id AS o1_id,
       o1.account_id AS o1_account_id,
       o1.occurred_at AS o1_occurred_at,
       o2.id AS o2_id,
       o2.account_id AS o2_account_id,
       o2.occurred_at AS o2_occurred_at
  FROM orders o1
 LEFT JOIN orders o2
   ON o1.account_id = o2.account_id
  AND o2.occurred_at > o1.occurred_at
  AND o2.occurred_at <= o1.occurred_at + INTERVAL '28 days'
ORDER BY o1.account_id, o1.occurred_at
```

##### Here we join it through account id but occurred_at indicate that 2 rows are being related with respect to "occured at" relation and the relation is defined by distance/ interval between 2 events for 28 days.

### Performance Tuning - 1:
* to check the query output
    * Use LIMIT to check the query output
    * LIMIT is the last operation in the SELECT statement, so use sub sample in FROM statement
    ```
    SELECT account_id, SUM(*)
    FROM (SELECT * FROM TABLE LIMIT 100)
    WHERE account_id < 200
    ```
    * Here Subquery is executed at FROM clause and then on the 100 rows , aggregation is applied and finally where clause is applied. Knowing this info will help us query build time reduction.

### Performance Tuning - 2
* when 2 tables are being joined then doublecheck if all rows are required from both tables.

```
SELECT t1.col1, SUM(t1.col1)
FROM table1 t1
JOIN table2 t2
ON t1.col1 = t2.col1
GROUP BY 1
ORDER BY 2
```
##### Let us compare the above query with below one:

```
SELECT t1.col1, SUM(t1.col1)
FROM table1 t1
JOIN ( SELECT t2.col1, SUM(t2.col1) 
        FROM table2 t2
        GROUP BY 1
       ) sub
       
ON t1.col1 = sub.col1
```

##### Here first table2 is shrinked for unique col1 values then the join operation happens on this subset and hence faster.

##### You might have also noticed that it is repeatetion of SUM aggregation function
```
SELECT sub.*
FROM table1 t1
JOIN(SELECT t2.col1, SUM(t2.col1)
        FROM table2 t2
        GROUP BY 1
        ) sub
on t1.col1 = sub.col1
```

### Performance Tuning - 3:
* User EXPLAIN query to see the cost first and then work on the costlier operation to reduce the cost.
    * EXPLAIN does not gives the exact measure but it can be used for relative comparison. i.e comparison with 2 costs for versions of the queries on the same table is legit but comparing cost with time or comparing cost with 2 logically different queries is not right way